products_api/app/controllers/baskets_controller.rb

SELECT "basket_products".* FROM "basket_products" WHERE "basket_products"."user_id" = ?  [["user_id", 1]]
SELECT "products".* FROM "products" INNER JOIN "basket_products" ON "products"."id" = "basket_products"."product_id" WHERE "basket_products"."user_id" = ?  [["user_id", 1]]
SELECT "basket_products".* FROM "basket_products" WHERE "basket_products"."user_id" = ? AND "basket_products"."amount" != ?  [["user_id", 1], ["amount", 0]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        basket_product = @user.basket_product.where.not(amount: 0).includes(:product)
        render json: { message: 'success', basket: basket_product.map { |scoped_basket_products| { amount: scoped_basket_products.amount, product: scoped_basket_products.product } } }

SELECT "basket_products".* FROM "basket_products" WHERE "basket_products"."user_id" = ? AND "basket_products"."product_id" = ? LIMIT ?  [["user_id", 1], ["product_id", 2], ["LIMIT", 1]]
UPDATE "basket_products" SET "amount" = ?, "updated_at" = ? WHERE "basket_products"."id" = ?  [["amount", 1], ["updated_at", "2023-11-08 11:36:44.750759"], ["id", 2]]
SELECT "basket_products".* FROM "basket_products" WHERE "basket_products"."user_id" = ? AND "basket_products"."amount" != ?  [["user_id", 1], ["amount", 0]]
SELECT "products".* FROM "products" INNER JOIN "basket_products" ON "products"."id" = "basket_products"."product_id" WHERE "basket_products"."user_id" = ?  [["user_id", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
    def update
        existing_product_relation = @user.basket_product.find_by(product_id: params[:product_id])
        if existing_product_relation.blank?
            BasketProduct.create(user_id: @user_id, product_id: params[:amount])
        else
            existing_product_relation.amount = params[:amount]
            existing_product_relation.save!
        end

        @user.reload
        basket_product = @user.basket_product.where.not(amount: 0).includes(:product)
        render json: { message: 'success', basket: basket_product.map { |scoped_basket_products| { amount: scoped_basket_products.amount, product: scoped_basket_products.product } } }