products_api/app/controllers/users_controller.rb

    def index
        render json: User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.valid?
            user.save!
---
INSERT INTO "users" ("full_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["full_name", "Super Admin"], ["email", "admin@test.dk"], ["password_digest", "[FILTERED]"], ["created_at", "2023-11-06 12:41:44.989648"], ["updated_at", "2023-11-06 12:41:44.989648"]]