products_api/app/models/product.rb

    def to_ordered_product!(order_id:)
        OrderedProduct.create!(order_id: order_id, product_id: self.id, baught_price: self.price)
---
INSERT INTO "ordered_products" ("order_id", "product_id", "baught_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["order_id", 2], ["product_id", 1], ["baught_price", 60], ["created_at", "2023-11-10 09:52:32.460162"], ["updated_at", "2023-11-10 09:52:32.460162"]]