products_api/app/models/user.rb

    def self.from_jwt(jwt)
        payload = JwtService.decode(jwt)
        User.find(payload[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]