products_api/app/controllers/V1/application_controller.rb

SELECT "apikeys".* FROM "apikeys" WHERE "apikeys"."key" = ? LIMIT ?  [["key", "bf25650e-a0e2-4d7b-bc8d-396551218904"], ["LIMIT", 1]]
---
        def validate_apikey
            key = request.headers["x-api-key"]
            apikey = Apikey.find_by(key: key)
            if apikey.blank?