products_api/app/controllers/V1/orders_controller.rb

        def index
            success_response(data: @user.orders.includes(:ordered_products).as_json(include: { ordered_products: {} }))
---
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" IN (?, ?, ?, ?)  [["order_id", 1], ["order_id", 2], ["order_id", 3], ["order_id", 4]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]