products_api/app/controllers/V1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@test.dk"], ["LIMIT", 1]]
---
        def create
            user = User.find_by(email: session_params[:email])