products_api/app/controllers/V1/users_controller.rb

        def create
            user = User.new(user_params)
            if user.valid?
                user.save!
---
INSERT INTO "users" ("full_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["full_name", "Swagger User"], ["email", "swagger@test.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-11-12 11:18:58.752812"], ["updated_at", "2023-11-12 11:18:58.752812"]]